Antonio-1110/RB4107_AY2627/firmware/22_mqtt_publishing/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
# Waveshare ESP32-S3-ETH-8DI-8RO: at least 4 MB flash; the networked builds
# need more than the default 1 MB app partition.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
# No C6 needed: a simulated sensor node plays a scenario (menuconfig to change).
CONFIG_RB_SIM_NODE=y
